colinporth/seggerF7/BSP/stm32746g_ov9655.c
//{{{  includes
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_camera.h"
//}}}
//{{{  OV9655 Registers definition
#define  OV9655_ID    0x96

#define OV9655_SENSOR_PIDH              0x0A
#define OV9655_SENSOR_PIDL              0x0B
#define OV9655_SENSOR_COM7              0x12
#define OV9655_SENSOR_TSLB              0x3A
#define OV9655_SENSOR_MTX1              0x4F
#define OV9655_SENSOR_MTX2              0x50
#define OV9655_SENSOR_MTX3              0x51
#define OV9655_SENSOR_MTX4              0x52
#define OV9655_SENSOR_MTX5              0x53
#define OV9655_SENSOR_MTX6              0x54
#define OV9655_SENSOR_BRTN              0x55
#define OV9655_SENSOR_CNST1             0x56
#define OV9655_SENSOR_CNST2             0x57

#define OV9655_BRIGHTNESS_LEVEL0        0xB0     /* Brightness level -2         */
#define OV9655_BRIGHTNESS_LEVEL1        0x98     /* Brightness level -1         */
#define OV9655_BRIGHTNESS_LEVEL2        0x00     /* Brightness level 0          */
#define OV9655_BRIGHTNESS_LEVEL3        0x18     /* Brightness level +1         */
#define OV9655_BRIGHTNESS_LEVEL4        0x30     /* Brightness level +2         */

#define OV9655_CONTRAST_LEVEL0          0x30     /* Contrast level -2           */
#define OV9655_CONTRAST_LEVEL1          0x38     /* Contrast level -1           */
#define OV9655_CONTRAST_LEVEL2          0x40     /* Contrast level 0            */
#define OV9655_CONTRAST_LEVEL3          0x50     /* Contrast level +1           */
#define OV9655_CONTRAST_LEVEL4          0x60     /* Contrast level +2           */

#define CAMERA_480x272_RES_X 480
#define CAMERA_480x272_RES_Y 272
#define CAMERA_VGA_RES_X     640
#define CAMERA_VGA_RES_Y     480
#define CAMERA_QVGA_RES_X    320
#define CAMERA_QVGA_RES_Y    240
#define CAMERA_QQVGA_RES_X   160
#define CAMERA_QQVGA_RES_Y   120
//}}}

//{{{
// OV9655_GAIN       0x00
// OV9655_BLUE       0x01
// OV9655_RED        0x02
// OV9655_VREF       0x03
// OV9655_COM1       0x04
// OV9655_BAVE       0x05
// OV9655_GbAVE      0x06
// OV9655_GrAVE      0x07
// OV9655_RAVE       0x08
// OV9655_COM2       0x09
// OV9655_PID        0x0A
// OV9655_VER        0x0B
// OV9655_COM3       0x0C
// OV9655_COM4       0x0D
// OV9655_COM5       0x0E
// OV9655_COM6       0x0F
// OV9655_AEC        0x10
// OV9655_CLKRC      0x11
// OV9655_COM7       0x12
// OV9655_COM8       0x13
// OV9655_COM9       0x14
// OV9655_COM10      0x15
// OV9655_REG16      0x16
// OV9655_HSTART     0x17
// OV9655_HSTOP      0x18
// OV9655_VSTART     0x19
// OV9655_VSTOP      0x1A
// OV9655_PSHFT      0x1B
// OV9655_MIDH       0x1C
// OV9655_MIDL       0x1D
// OV9655_MVFP       0x1E
// OV9655_BOS        0x20
// OV9655_GBOS       0x21
// OV9655_GROS       0x22
// OV9655_ROS        0x23
// OV9655_AEW        0x24
// OV9655_AEB        0x25
// OV9655_VPT        0x26
// OV9655_BBIAS      0x27
// OV9655_GbBIAS     0x28
// OV9655_PREGAIN    0x29
// OV9655_EXHCH      0x2A
// OV9655_EXHCL      0x2B
// OV9655_RBIAS      0x2C
// OV9655_ADVFL      0x2D
// OV9655_ADVFH      0x2E
// OV9655_YAVE       0x2F
// OV9655_HSYST      0x30
// OV9655_HSYEN      0x31
// OV9655_HREF       0x32
// OV9655_CHLF       0x33
// OV9655_AREF1      0x34
// OV9655_AREF2      0x35
// OV9655_AREF3      0x36
// OV9655_ADC1       0x37
// OV9655_ADC2       0x38
// OV9655_AREF4      0x39
// OV9655_TSLB       0x3A
// OV9655_COM11      0x3B
// OV9655_COM12      0x3C
// OV9655_COM13      0x3D
// OV9655_COM14      0x3E
// OV9655_EDGE       0x3F
// OV9655_COM15      0x40
// OV9655_COM16      0x41
// OV9655_COM17      0x42
// OV9655_MTX1       0x4F
// OV9655_MTX2       0x50
// OV9655_MTX3       0x51
// OV9655_MTX4       0x52
// OV9655_MTX5       0x53
// OV9655_MTX6       0x54
// OV9655_BRTN       0x55
// OV9655_CNST1      0x56
// OV9655_CNST2      0x57
// OV9655_MTXS       0x58
// OV9655_AWBOP1     0x59
// OV9655_AWBOP2     0x5A
// OV9655_AWBOP3     0x5B
// OV9655_AWBOP4     0x5C
// OV9655_AWBOP5     0x5D
// OV9655_AWBOP6     0x5E
// OV9655_BLMT       0x5F
// OV9655_RLMT       0x60
// OV9655_GLMT       0x61
// OV9655_LCC1       0x62
// OV9655_LCC2       0x63
// OV9655_LCC3       0x64
// OV9655_LCC4       0x65
// OV9655_MANU       0x66
// OV9655_MANV       0x67
// OV9655_MANY       0x68
// OV9655_VARO       0x69
// OV9655_BD50MAX    0x6A
// OV9655_DBLV       0x6B
// OV9655_DNSTH      0x70
// OV9655_POIDX      0x72
// OV9655_PCKDV      0x73
// OV9655_XINDX      0x74
// OV9655_YINDX      0x75
// OV9655_SLOP       0x7A
// OV9655_GAM1       0x7B
// OV9655_GAM2       0x7C
// OV9655_GAM3       0x7D
// OV9655_GAM4       0x7E
// OV9655_GAM5       0x7F
// OV9655_GAM6       0x80
// OV9655_GAM7       0x81
// OV9655_GAM8       0x82
// OV9655_GAM9       0x83
// OV9655_GAM10      0x84
// OV9655_GAM11      0x85
// OV9655_GAM12      0x86
// OV9655_GAM13      0x87
// OV9655_GAM14      0x88
// OV9655_GAM15      0x89
// OV9655_COM18      0x8B
// OV9655_COM19      0x8C
// OV9655_COM20      0x8D
// OV9655_DMLNL      0x92
// OV9655_DMLNH      0x93
// OV9655_LCC6       0x9D
// OV9655_LCC7       0x9E
// OV9655_AECH       0xA1
// OV9655_BD50       0xA2
// OV9655_BD60       0xA3
// OV9655_COM21      0xA4
// OV9655_GREEN      0xA6
// OV9655_VZST       0xA7
// OV9655_REFA8      0xA8
// OV9655_REFA9      0xA9
// OV9655_BLC1       0xAC
// OV9655_BLC2       0xAD
// OV9655_BLC3       0xAE
// OV9655_BLC4       0xAF
// OV9655_BLC5       0xB0
// OV9655_BLC6       0xB1
// OV9655_BLC7       0xB2
// OV9655_BLC8       0xB3
// OV9655_CTRLB4     0xB4
// OV9655_FRSTL      0xB7
// OV9655_FRSTH      0xB8
// OV9655_ADBOFF     0xBC
// OV9655_ADROFF     0xBD
// OV9655_ADGbOFF    0xBE
// OV9655_ADGrOFF    0xBF
// OV9655_COM23      0xC4
// OV9655_BD60MAX    0xC5
// OV9655_COM24      0xC7
//}}}
//{{{
const uint8_t OV9655_640x480[][2] = {
  {0x00, 0x00}, // OV9655_GAIN
  {0x01, 0x80}, // OV9655_BLUE
  {0x02, 0x80}, // OV9655_RED
  {0x03, 0x12}, // OV9655_VREF
  {0x04, 0x03}, // OV9655_COM1
  {0x05, 0x2e}, // OV9655_BAVE
  {0x06, 0x2e}, // OV9655_GbAVE
  {0x07, 0x2e}, // OV9655_GrAVE
  {0x08, 0x2e}, // OV9655_RAVE
                // OV9655_COM2       0x09
                // OV9655_PID        0x0A
                // OV9655_VER        0x0B
                // OV9655_COM3       0x0C
                // OV9655_COM4       0x0D
  {0x0e, 0x61}, // OV9655_COM5
  {0x0f, 0x48}, // OV9655_COM6

