colinporth/seggerF7/BSP/stm32746g_ov9655.c
  {0x10, 0x7b}, // OV9655_AEC
  {0x11, 0x03}, // OV9655_CLKRC
  {0x12, 0x63}, // OV9655_COM7
  {0x13, 0xe7}, // OV9655_COM8
  {0x14, 0x3a}, // OV9655_COM9
                // OV9655_COM10
  {0x16, 0x24}, // OV9655_REG16
  {0x17, 0x16}, // OV9655_HSTART
  {0x18, 0x02}, // OV9655_HSTOP
  {0x19, 0x01}, // OV9655_VSTART
  {0x1a, 0x3d}, // OV9655_VSTOP
                // OV9655_PSHFT      0x1B
                // OV9655_MIDH       0x1C
                // OV9655_MIDL       0x1D
  {0x1e, 0x04}, // OV9655_MVFP

                // OV9655_BOS        0x20
                // OV9655_GBOS       0x21
                // OV9655_GROS       0x22
                // OV9655_ROS        0x23
  {0x24, 0x3c}, // OV9655_AEW
  {0x25, 0x36},
  {0x26, 0x72}, // OV9655_VPT
  {0x27, 0x08},
  {0x28, 0x08},
  {0x29, 0x15},
  {0x2a, 0x00},
  {0x2b, 0x00},
  {0x2c, 0x08},
  {0x2f, 0x2e},

  {0x32, 0xff},
  {0x33, 0x00},
  {0x34, 0x3d},
  {0x35, 0x00}, // OV9655_AREF2
  {0x36, 0xfa},
  {0x39, 0x57},
  {0x3a, 0xcc}, // OV9655_TSLB
  {0x3b, 0xcc},
  {0x3d, 0x99}, // OV9655_COM13
  {0x3e, 0x0c},
  {0x3f, 0x82},

  {0x40, 0xd0}, // OV9655_COM15
  {0x41, 0x40},
  {0x42, 0xc0},
  {0x43, 0x14},
  {0x44, 0xf0},
  {0x45, 0x46},
  {0x46, 0x62},
  {0x47, 0x2a},
  {0x48, 0x3c},
  {0x4a, 0xe9},
  {0x4b, 0xdd},
  {0x4c, 0xdd},
  {0x4d, 0xdd},
  {0x4e, 0xdd},
  {0x4f, 0x98},

  {0x50, 0x98},
  {0x51, 0x00},
  {0x52, 0x28},
  {0x53, 0x70},
  {0x54, 0x98},
                // OV9655_BRTN       0x55
                // OV9655_CNST1      0x56
                // OV9655_CNST2      0x57
  {0x58, 0x1a},
  {0x59, 0x85},
  {0x5a, 0xa9},
  {0x5b, 0x64},
  {0x5c, 0x84},
  {0x5d, 0x53},
  {0x5e, 0x0e},

  {0x62, 0x00},
  {0x63, 0x00},
  {0x64, 0x02},
  {0x65, 0x20},
  {0x66, 0x01},
  {0x69, 0x0a},
  {0x6b, 0x5a},
  {0x6c, 0x0c},
  {0x6e, 0x00},
  {0x6d, 0x55},
  {0x6f, 0x9e},

  {0x70, 0x06},
  {0x71, 0x78},
  {0x72, 0x00},
  {0x73, 0x00},
  {0x74, 0x3a},
  {0x75, 0x35},
  {0x76, 0x01},
  {0x77, 0x02},
  {0x7a, 0x20},
  {0x7b, 0x1c}, // OV9655_GAM1
  {0x7c, 0x28}, // OV9655_GAM2
  {0x7d, 0x3c}, // OV9655_GAM3
  {0x7e, 0x5a}, // OV9655_GAM4
  {0x7f, 0x68}, // OV9655_GAM5

  {0x80, 0x76}, // OV9655_GAM6
  {0x81, 0x80}, // OV9655_GAM7
  {0x82, 0x88}, // OV9655_GAM8
  {0x83, 0x8f}, // OV9655_GAM9
  {0x84, 0x96}, // OV9655_GAM10
  {0x85, 0xa3}, // OV9655_GAM11
  {0x86, 0xaf}, // OV9655_GAM12
  {0x87, 0xc4}, // OV9655_GAM13
  {0x88, 0xd7}, // OV9655_GAM14
  {0x89, 0xe8}, // OV9655_GAM15
  {0x8a, 0x23},
  {0x8c, 0x8d},

  {0x90, 0x92},
  {0x91, 0x92},
  {0x9d, 0x02},
  {0x9e, 0x02},
  {0x9f, 0x90},

  {0xa0, 0x90},
  {0xa4, 0x50},
  {0xa5, 0x68},
  {0xa6, 0x40},
  {0xa8, 0xc1}, // OV9655_REFA8
  {0xa9, 0xef},
  {0xaa, 0x92},
  {0xab, 0x04},
  {0xac, 0x80},
  {0xad, 0x80},
  {0xae, 0x80},
  {0xaf, 0x80},

  {0xb2, 0xf2},
  {0xb3, 0x20},
  {0xb4, 0x20},
  {0xb5, 0x00},
  {0xb6, 0xaf},
  {0xbb, 0xae},
  {0xbc, 0x02},
  {0xbd, 0x01},
  {0xbe, 0x02},
  {0xbf, 0x01},

  {0xc0, 0xaa},
  {0xc1, 0xc8},
  {0xc2, 0x01},
  {0xc3, 0x4e},
  {0xc6, 0x85},
  {0xc7, 0x80},
  {0xc9, 0xe0},
  {0xca, 0xe8},
  {0xcb, 0xf0},
  {0xcc, 0xd8},
  {0xcd, 0x93},

  {0x12, 0x63},  // OV9655_COM7
  {0x40, 0x10},  // OV9655_COM15
  };
//}}}
//{{{
const uint8_t OV9655_320x240[][2] = {
  {0x00, 0x00},
  {0x01, 0x80},
  {0x02, 0x80},
  {0x03, 0x02},
  {0x04, 0x03},
  {0x09, 0x01},
  {0x0b, 0x57},
  {0x0e, 0x61},
  {0x0f, 0x40},

  {0x11, 0x01},
  {0x12, 0x62},
  {0x13, 0xc7},
  {0x14, 0x3a},
  {0x16, 0x24},
  {0x17, 0x18},
  {0x18, 0x04},
  {0x19, 0x01},
  {0x1a, 0x81},
  {0x1e, 0x00},

  {0x24, 0x3c},
  {0x25, 0x36},
  {0x26, 0x72},
  {0x27, 0x08},
  {0x28, 0x08},
  {0x29, 0x15},
  {0x2a, 0x00},
  {0x2b, 0x00},
  {0x2c, 0x08},

  {0x32, 0x12},
  {0x33, 0x00},
  {0x34, 0x3f},
  {0x35, 0x00},
  {0x36, 0x3a},
  {0x38, 0x72},
  {0x39, 0x57},
  {0x3a, 0xcc},
  {0x3b, 0x04},
  {0x3d, 0x99},
  {0x3e, 0x02},
  {0x3f, 0xc1},

  {0x40, 0xc0},
  {0x41, 0x41},
  {0x42, 0xc0},
  {0x43, 0x0a},
  {0x44, 0xf0},
  {0x45, 0x46},
  {0x46, 0x62},
  {0x47, 0x2a},
  {0x48, 0x3c},
  {0x4a, 0xfc},
  {0x4b, 0xfc},
  {0x4c, 0x7f},
  {0x4d, 0x7f},
  {0x4e, 0x7f},
  {0x4f, 0x98},

  {0x50, 0x98},
  {0x51, 0x00},
  {0x52, 0x28},
  {0x53, 0x70},
  {0x54, 0x98},
  {0x58, 0x1a},
  {0x59, 0x85},
  {0x5a, 0xa9},
  {0x5b, 0x64},
  {0x5c, 0x84},
  {0x5d, 0x53},
  {0x5e, 0x0e},
  {0x5f, 0xf0},

  {0x60, 0xf0},
  {0x61, 0xf0},
  {0x62, 0x00},
  {0x63, 0x00},
  {0x64, 0x02},
  {0x65, 0x20},
  {0x66, 0x00},
  {0x69, 0x0a},
  {0x6b, 0x5a},
  {0x6c, 0x04},
  {0x6d, 0x55},
  {0x6e, 0x00},
  {0x6f, 0x9d},

  {0x70, 0x21},
  {0x71, 0x78},
  {0x72, 0x11},
  {0x73, 0x01},
  {0x74, 0x10},
  {0x75, 0x10},
  {0x76, 0x01},
  {0x77, 0x02},
  {0x7A, 0x12},
  {0x7B, 0x08},
  {0x7C, 0x16},
  {0x7D, 0x30},
  {0x7E, 0x5e},
  {0x7F, 0x72},

  {0x80, 0x82},
  {0x81, 0x8e},
  {0x82, 0x9a},
  {0x83, 0xa4},
  {0x84, 0xac},
  {0x85, 0xb8},
  {0x86, 0xc3},
  {0x87, 0xd6},
  {0x88, 0xe6},
  {0x89, 0xf2},
  {0x8a, 0x24},
  {0x8c, 0x80},

  {0x90, 0x7d},
  {0x91, 0x7b},
  {0x9d, 0x02},
  {0x9e, 0x02},
  {0x9f, 0x7a},

  {0xa0, 0x79},
  {0xa1, 0x40},
  {0xa4, 0x50},
  {0xa5, 0x68},
  {0xa6, 0x4a},
  {0xa8, 0xc1},
  {0xa9, 0xef},
  {0xaa, 0x92},
  {0xab, 0x04},
  {0xac, 0x80},
  {0xad, 0x80},
  {0xae, 0x80},
  {0xaf, 0x80},

  {0xb2, 0xf2},
  {0xb3, 0x20},
  {0xb4, 0x20},
  {0xb5, 0x00},
  {0xb6, 0xaf},
  {0xb6, 0xaf},
  {0xbb, 0xae},
  {0xbc, 0x7f},
  {0xbd, 0x7f},
  {0xbe, 0x7f},
  {0xbf, 0x7f},
  {0xbf, 0x7f},

  {0xc0, 0xaa},
  {0xc1, 0xc0},
  {0xc2, 0x01},
  {0xc3, 0x4e},
  {0xc6, 0x05},
  {0xc7, 0x81},
  {0xc9, 0xe0},
  {0xca, 0xe8},
  {0xcb, 0xf0},
  {0xcc, 0xd8},
  {0xcd, 0x93},

  {0x12, 0x63},
  {0x40, 0x10},
  };
//}}}
//{{{
const uint8_t OV9655_160x120[][2] = {
  {0x00, 0x00},
  {0x01, 0x80},
  {0x02, 0x80},
  {0x03, 0x02},
  {0x04, 0x03},
  {0x09, 0x01},
  {0x0b, 0x57},
  {0x0e, 0x61},
  {0x0f, 0x40},

  {0x11, 0x01},
  {0x12, 0x62},
  {0x13, 0xc7},
  {0x14, 0x3a},
  {0x16, 0x24},
  {0x17, 0x18},
  {0x18, 0x04},
  {0x19, 0x01},
  {0x1a, 0x81},
  {0x1e, 0x00},

