colinporth/seggerF7/BSP/stm32746g_ov9655.c
  }
//}}}
//{{{
static void init (uint16_t DeviceAddr, uint32_t resolution) {

  CAMERA_IO_Init();
  CAMERA_Delay (200);

  switch (resolution) {
    case CAMERA_R160x120: {
      for (uint32_t index = 0; index < (sizeof(OV9655_160x120)/2); index++) {
        CAMERA_IO_Write (DeviceAddr, OV9655_160x120[index][0], OV9655_160x120[index][1]);
        CAMERA_Delay (2);
        }
      break;
      }

    case CAMERA_R320x240: {
      for (uint32_t index = 0; index < (sizeof(OV9655_320x240)/2); index++) {
        CAMERA_IO_Write (DeviceAddr, OV9655_320x240[index][0], OV9655_320x240[index][1]);
        CAMERA_Delay (2);
        }
      break;
      }

    case CAMERA_R640x480: {
      for (uint32_t index = 0; index < (sizeof(OV9655_640x480)/2); index++) {
        CAMERA_IO_Write (DeviceAddr, OV9655_640x480[index][0], OV9655_640x480[index][1]);
        CAMERA_Delay (2);
        }
      break;
      }

    default: {
      break;
      }
    }
  }
//}}}
//{{{
static void config (uint16_t DeviceAddr, uint32_t value, uint32_t brightness_value) {

  uint64_t value_tmp;
  uint32_t br_value;

  /* Convert the input value into ov9655 parameters */
  value_tmp = convertValue (value);
  br_value = (uint32_t)convertValue (brightness_value);
  CAMERA_IO_Write (DeviceAddr, OV9655_SENSOR_BRTN, br_value);
  CAMERA_IO_Write (DeviceAddr, OV9655_SENSOR_CNST1, value_tmp);
  }
//}}}
//{{{
static uint16_t readID (uint16_t DeviceAddr) {

  CAMERA_IO_Init();
  return (CAMERA_IO_Read (DeviceAddr, OV9655_SENSOR_PIDH));
  }
//}}}

// external
//{{{
uint32_t BSP_CAMERA_Init (uint32_t Resolution) {

  // Configures the DCMI to interface with the camera module
  DCMI_HandleTypeDef* hDcmi    = &hDcmiHandler;
  hDcmi->Instance              = DCMI;
  hDcmi->Init.CaptureRate      = DCMI_CR_ALL_FRAME;
  hDcmi->Init.HSPolarity       = DCMI_HSPOLARITY_LOW;
  hDcmi->Init.SynchroMode      = DCMI_SYNCHRO_HARDWARE;
  hDcmi->Init.VSPolarity       = DCMI_VSPOLARITY_HIGH;
  hDcmi->Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
  hDcmi->Init.PCKPolarity      = DCMI_PCKPOLARITY_RISING;

  BSP_CAMERA_PowerUp();

  uint32_t readBack = readID (CAMERA_I2C_ADDRESS_OV9655);
  if (readBack == OV9655_ID) {
    mspInit (&hDcmiHandler, NULL);
    HAL_DCMI_Init (hDcmi);

    if (Resolution == CAMERA_R480x272) {
      // 480x272 uses cropped 640x480
      init (CAMERA_I2C_ADDRESS_OV9655, CAMERA_R640x480);
      HAL_DCMI_ConfigCROP (hDcmi,
                           (CAMERA_VGA_RES_X - CAMERA_480x272_RES_X)/2,
                           (CAMERA_VGA_RES_Y - CAMERA_480x272_RES_Y)/2,
                           (CAMERA_480x272_RES_X * 2) - 1,
                           CAMERA_480x272_RES_Y - 1);
      HAL_DCMI_EnableCROP (hDcmi);
      }
    else {
      init (CAMERA_I2C_ADDRESS_OV9655, Resolution);
      HAL_DCMI_DisableCROP (hDcmi);
      }

    CameraCurrentResolution = Resolution;
    }

  return readBack;
  }
//}}}
//{{{
void BSP_CAMERA_DeInit() {

  hDcmiHandler.Instance = DCMI;
  HAL_DCMI_DeInit (&hDcmiHandler);
  mspDeInit (&hDcmiHandler, NULL);
  }
//}}}

//{{{
uint32_t BSP_CAMERA_getXSize() {

  switch (CameraCurrentResolution) {
    case CAMERA_R160x120: return 160;
    case CAMERA_R320x240: return 320;
    case CAMERA_R480x272: return 480;
    case CAMERA_R640x480: return 640;
    default: return 0;
    }
  }
//}}}
//{{{
uint32_t BSP_CAMERA_getYSize() {

  switch (CameraCurrentResolution) {
    case CAMERA_R160x120: return 120;
    case CAMERA_R320x240: return 240;
    case CAMERA_R480x272: return 272;
    case CAMERA_R640x480: return 280;
    default: return 0;
    }
  }
//}}}

//{{{
void BSP_CAMERA_SnapshotStart (uint8_t* buff) {
  HAL_DCMI_Start_DMA (&hDcmiHandler, DCMI_MODE_SNAPSHOT, (uint32_t)buff, getPix (CameraCurrentResolution));
  }
//}}}
//{{{
void BSP_CAMERA_ContinuousStart (uint8_t* buff) {
  HAL_DCMI_Start_DMA (&hDcmiHandler, DCMI_MODE_CONTINUOUS, (uint32_t)buff, getPix (CameraCurrentResolution));
  }
//}}}
//{{{
void BSP_CAMERA_ContrastBrightness (uint32_t contrast_level, uint32_t brightness_level) {
  config (CAMERA_I2C_ADDRESS_OV9655, contrast_level, brightness_level);
  }
//}}}

//{{{
void BSP_CAMERA_Stop() {

  HAL_DCMI_Stop (&hDcmiHandler);
  BSP_CAMERA_PowerDown();
  }
//}}}
//{{{
void BSP_CAMERA_PowerUp() {

  __HAL_RCC_GPIOH_CLK_ENABLE();

  // Configure DCMI GPIO as alternate function
  GPIO_InitTypeDef gpio_init_structure;
  gpio_init_structure.Pin = GPIO_PIN_13;
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init (GPIOH, &gpio_init_structure);

  // De-assert the camera POWER_DOWN pin (active high)
  HAL_GPIO_WritePin (GPIOH, GPIO_PIN_13, GPIO_PIN_RESET);

  HAL_Delay (3);     // POWER_DOWN de-asserted during 3ms
  }
//}}}
//{{{
void BSP_CAMERA_PowerDown() {

  __HAL_RCC_GPIOH_CLK_ENABLE();

  // Configure DCMI GPIO as alternate function
  GPIO_InitTypeDef gpio_init_structure;
  gpio_init_structure.Pin = GPIO_PIN_13;
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init (GPIOH, &gpio_init_structure);

  // Assert the camera POWER_DOWN pin (active high)
  HAL_GPIO_WritePin (GPIOH, GPIO_PIN_13, GPIO_PIN_SET);
  }
//}}}
void BSP_CAMERA_Suspend() { HAL_DCMI_Suspend (&hDcmiHandler); }
void BSP_CAMERA_Resume() { HAL_DCMI_Resume (&hDcmiHandler); }

void HAL_DCMI_LineEventCallback (DCMI_HandleTypeDef* hdcmi) {}
void HAL_DCMI_VsyncEventCallback (DCMI_HandleTypeDef* hdcmi) {}
void HAL_DCMI_FrameEventCallback (DCMI_HandleTypeDef* hdcmi) {}
void HAL_DCMI_ErrorCallback (DCMI_HandleTypeDef* hdcmi) {}
